Revit 2027 API
ElementParameterFilter(IList<FilterRule>) Constructor
 Constructs a new instance of an ElementParameterFilter from a set of rules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementParameterFilter(
	IList<FilterRule> filterRules
)
Public Sub New (
	filterRules As IList(Of FilterRule)
)
public:
ElementParameterFilter(
	IList<FilterRule^>^ filterRules
)
new :
        filterRules : IList<FilterRule> -> ElementParameterFilter
Parameters
filterRules IList<FilterRule>
 The rules applied to test if the element passes this filter.
Exceptions
Exception | Condition
ArgumentException |  The filterRules array is empty or invalid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementParameterFilter Class
ElementParameterFilter Overload
Autodesk.Revit.DB Namespace